load_tests/post-commit.yml
#!/usr/local/bin/bzt -report
---

scenarios:
  pre-commit:
    default-address: http://localhost:8000
    requests:
    - include-scenario: home-page
    - include-scenario: reservation

execution:
  concurrency: 20
  hold-for: 1m
  ramp-up: 30s
  scenario: pre-commit

services:
- module: passfail
  criteria:
  - avg-rt of Home>150ms for 10s, stop as failed
  - fail of Home>1% for 10s, stop as failed
  - avg-rt of reservation>5s for 10s, stop as failed
  - fail of reservation>10% for 10s, stop as failed

modules:
  console:
    disable: true
  blazemeter:
    browser-open: false