load_tests/staging2.yml
#!/usr/local/bin/bzt -report
---

scenarios:
  staging:
    default-address: http://54.210.176.248:8000
    requests:
    - include-scenario: home-page
    - include-scenario: reservation

provisioning: cloud

execution:
  locations:
    us-east-1: 1
  concurrency: 
    cloud: 50
  hold-for: 3m
  ramp-up: 3m
  scenario: staging

services:
- module: passfail
  criteria:
  - avg-rt of Home>150ms for 10s, stop as failed
  - fail of Home>1% for 10s, stop as failed
  - avg-rt of reservation>5s for 10s, stop as failed
  - fail of reservation>10% for 10s, stop as failed

modules:
  cloud:
    test: simple_travel staging
    project: simple_travel
  console:
    disable: true
  blazemeter:
    browser-open: false